; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v11 ?v6)
             (pred_7 ?v1 ?v13)
             (pred_4 ?v11 ?v13)
             (pred_3 ?v3 ?v11 )
	     (pred_8 ?v11)
             (pred_11 ?v7)
             (pred_2 ?v1)
             (pred_5 ?v13)
             (pred_12 ?v11)
             (pred_1 ?v1)
             (pred_10 ?v11)
             (pred_9 ))



(:action op_4
:parameters (?v8 ?v10 ?v9 ?v5)
:precondition (and (pred_11 ?v8) (pred_11 ?v10) (pred_2 ?v9) (pred_5 ?v5)
          (pred_6 ?v8 ?v10) (pred_7 ?v9 ?v5)
                   (pred_4 ?v10 ?v5) (pred_8 ?v8) 
                   (pred_12 ?v10) (pred_1 ?v9))
:effect (and  (pred_10 ?v10) (not (pred_12 ?v10))))


(:action op_3
:parameters (?v8 ?v2)
:precondition (and (pred_11 ?v8) (pred_11 ?v2)
               (pred_8 ?v8) (pred_6 ?v8 ?v2) (pred_10 ?v2))
:effect (and (pred_8 ?v2) (not (pred_8 ?v8))))

(:action op_1
:parameters (?v8 ?v9)
:precondition (and (pred_11 ?v8) (pred_2 ?v9) 
                  (pred_8 ?v8) (pred_3 ?v9 ?v8) (pred_9 ))
:effect (and (pred_1 ?v9)
   (not (pred_3 ?v9 ?v8)) (not (pred_9 ))))


(:action op_2
:parameters (?v8 ?v12 ?v4)
:precondition (and (pred_11 ?v8) (pred_2 ?v12) (pred_2 ?v4)
                  (pred_8 ?v8) (pred_1 ?v4) (pred_3 ?v12 ?v8))
:effect (and (pred_1 ?v12) (pred_3 ?v4 ?v8)
        (not (pred_1 ?v4)) (not (pred_3 ?v12 ?v8))))

(:action op_5
:parameters (?v8 ?v9)
:precondition (and (pred_11 ?v8) (pred_2 ?v9) 
                  (pred_8 ?v8) (pred_1 ?v9))
:effect (and (pred_9 ) (pred_3 ?v9 ?v8) (not (pred_1 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_16 obj_17 obj_09 obj_18 obj_07 obj_05 obj_12 obj_03 obj_04 obj_01 obj_19 obj_10 obj_08 obj_15 obj_02
    obj_14 obj_06
    obj_13 obj_20
    )

    (:init
       (pred_9)

       (pred_11 obj_11)
       (pred_11 obj_16)
       (pred_11 obj_17)
       (pred_11 obj_09)
       (pred_11 obj_18)
       (pred_11 obj_07)
       (pred_11 obj_05)
       (pred_11 obj_12)
       (pred_11 obj_03)
       (pred_11 obj_04)
       (pred_11 obj_01)
       (pred_11 obj_19)
       (pred_11 obj_10)
       (pred_11 obj_08)
       (pred_11 obj_15)
       (pred_11 obj_02)
       (pred_5 obj_14)
       (pred_5 obj_06)
       (pred_2 obj_13)
       (pred_2 obj_20)

       (pred_6 obj_11 obj_18)
       (pred_6 obj_11 obj_16)
       (pred_6 obj_16 obj_07)
       (pred_6 obj_16 obj_17)
       (pred_6 obj_16 obj_11)
       (pred_6 obj_17 obj_05)
       (pred_6 obj_17 obj_09)
       (pred_6 obj_17 obj_16)
       (pred_6 obj_09 obj_12)
       (pred_6 obj_09 obj_17)
       (pred_6 obj_18 obj_03)
       (pred_6 obj_18 obj_07)
       (pred_6 obj_18 obj_11)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_07 obj_05)
       (pred_6 obj_07 obj_16)
       (pred_6 obj_07 obj_18)
       (pred_6 obj_05 obj_01)
       (pred_6 obj_05 obj_12)
       (pred_6 obj_05 obj_17)
       (pred_6 obj_05 obj_07)
       (pred_6 obj_12 obj_19)
       (pred_6 obj_12 obj_09)
       (pred_6 obj_12 obj_05)
       (pred_6 obj_03 obj_10)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_03 obj_18)
       (pred_6 obj_04 obj_08)
       (pred_6 obj_04 obj_01)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_01 obj_15)
       (pred_6 obj_01 obj_19)
       (pred_6 obj_01 obj_05)
       (pred_6 obj_01 obj_04)
       (pred_6 obj_19 obj_02)
       (pred_6 obj_19 obj_12)
       (pred_6 obj_19 obj_01)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_10 obj_03)
       (pred_6 obj_08 obj_15)
       (pred_6 obj_08 obj_04)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_15 obj_02)
       (pred_6 obj_15 obj_01)
       (pred_6 obj_15 obj_08)
       (pred_6 obj_02 obj_19)
       (pred_6 obj_02 obj_15)
       (pred_12 obj_01)
       (pred_12 obj_10)
       (pred_4  obj_01 obj_14)
       (pred_4  obj_10 obj_06)
       (pred_10 obj_11)
       (pred_10 obj_16)
       (pred_10 obj_17)
       (pred_10 obj_09)
       (pred_10 obj_18)
       (pred_10 obj_07)
       (pred_10 obj_05)
       (pred_10 obj_12)
       (pred_10 obj_03)
       (pred_10 obj_04)
       (pred_10 obj_19)
       (pred_10 obj_08)
       (pred_10 obj_15)
       (pred_10 obj_02)

       (pred_7  obj_13 obj_14)
       (pred_7  obj_20 obj_06)
       (pred_3 obj_13 obj_05)
       (pred_3 obj_20 obj_18)
       (pred_8 obj_08)
    )

    (:goal (and
       (pred_3 obj_13 obj_04)
    ))
(:constraints
  (always (not (pred_8 obj_07)))
)
)

; plan
1. (op_3 obj_08 obj_04)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_04)
   goals met: 0 of 1
2. (op_3 obj_04 obj_03)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_03)
   goals met: 0 of 1
3. (op_3 obj_03 obj_18)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_18)
   goals met: 0 of 1
4. (op_3 obj_18 obj_11)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_11)
   goals met: 0 of 1
5. (op_3 obj_11 obj_16)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_16)
   goals met: 0 of 1
6. (op_3 obj_16 obj_17)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_17)
   goals met: 0 of 1
7. (op_3 obj_17 obj_05)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_05)
   goals met: 0 of 1
8. (op_1 obj_05 obj_13)
   deleted: (pred_3 obj_13 obj_05) (pred_9)
   added: (pred_1 obj_13)
   goals met: 0 of 1
9. (op_4 obj_05 obj_01 obj_13 obj_14)
   deleted: (pred_12 obj_01)
   added: (pred_10 obj_01)
   goals met: 0 of 1
10. (op_3 obj_05 obj_01)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_01)
   goals met: 0 of 1
11. (op_3 obj_01 obj_04)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_04)
   goals met: 0 of 1
12. (op_5 obj_04 obj_13)
   deleted: (pred_1 obj_13)
   added: (pred_9) (pred_3 obj_13 obj_04)
   goals met: 1 of 1
